In [1]:
# Data Exploration
import pandas as pd

data = {'Name':['Raghav', 'Manasi', 'Arya', 'Owais'],
        'Age':[17, 16, 18, 13],
        'Gender': ['M', 'F', 'F', 'M'],
        'Marks': [75, 'NaN', 38, 'NaN']}

df = pd.DataFrame(data)

df

     Name  Age Gender Marks
0  Raghav   17      M    75
1  Manasi   16      F   NaN
2    Arya   18      F    38
3   Owais   13      M   NaN

In [2]:
# Q: Replace the None value with the Average Value

i = avg = 0

for marks in df["Marks"]:
    if str(marks).isnumeric():
        i += 1
        avg += marks

avg /= i

df = df.replace(to_replace='NaN', value=avg)

df

     Name  Age Gender  Marks
0  Raghav   17      M   75.0
1  Manasi   16      F   56.5
2    Arya   18      F   38.0
3   Owais   13      M   56.5

In [3]:
# Reshaping: M: 0 F:1

df['Gender'] = df['Gender'].map({'M': 0, 'F':1}).astype(float)

df

     Name  Age  Gender  Marks
0  Raghav   17     0.0   75.0
1  Manasi   16     1.0   56.5
2    Arya   18     1.0   38.0
3   Owais   13     0.0   56.5

In [4]:
# Filtering

df = df[df['Marks'] >= 50]

df

     Name  Age  Gender  Marks
0  Raghav   17     0.0   75.0
1  Manasi   16     1.0   56.5
3   Owais   13     0.0   56.5

In [5]:
df = df.drop(['Age'], axis=1)

df

     Name  Gender  Marks
0  Raghav     0.0   75.0
1  Manasi     1.0   56.5
3   Owais     0.0   56.5